In [1]:
import pandas as pd
import numpy as np

In [5]:
%pip install pandas numpy

Collecting pandas
  Downloading pandas-2.2.3-cp311-cp311-macosx_10_9_x86_64.whl.metadata (89 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 89.9/89.9 kB 1.5 MB/s eta 0:00:00a 0:00:01
Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/fdi/Library/Python/3.11/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/fdi/Library/Python/3.11/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp311-cp311-macosx_10_9_x86_64.whl (12.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.6/12.6 MB 14.1 MB/s eta 0:00:0000:0100:01
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 508.0/508.0 kB 11.3 MB/s eta 0:00:0000:01
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 346.6/346.6 kB 8.7 MB/s eta 0:00:00ta 0:00:01
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
df = pd.read_csv(r'data/ds_salaries.csv')

In [4]:
df.head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [6]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [7]:
df.shape #longituddeDataFrame

(3755, 11)

In [8]:
df.dtypes #saber los tipos de datos

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [9]:
df.isnull().sum() #saber los valores nulo

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [10]:
df.duplicated().sum() #saber los valores duplicados

np.int64(1171)

In [20]:
duplicate_file = df[df.duplicated(keep=False)]
duplicate_file
# Falta algo

<bound method DataFrame.count of       work_year experience_level employment_type          job_title  salary  \
5          2023               SE              FT  Applied Scientist  222200
6          2023               SE              FT  Applied Scientist  136000
9          2023               SE              FT     Data Scientist  147100
10         2023               SE              FT     Data Scientist   90700
11         2023               SE              FT       Data Analyst  130000
...         ...              ...             ...                ...     ...
3441       2022               SE              FT      Data Engineer  115000
3502       2021               MI              FT      Data Engineer  200000
3586       2021               MI              FT      Data Engineer  200000
3665       2021               MI              FT     Data Scientist   76760
3709       2021               MI              FT     Data Scientist   76760

     salary_currency  salary_in_usd employee_residence  remote_ratio  \
5                USD         222200                 US             0
6                USD         136000                 US             0
9                USD         147100                 US             0
10               USD          90700                 US             0
11               USD         130000                 US           100
...              ...            ...                ...           ...
3441             USD         115000                 US           100
3502             USD         200000                 US           100
3586             USD         200000                 US           100
3665             EUR          90734                 DE            50
3709             EUR          90734                 DE            50

     company_location company_size
5                  US            L
6                  US            L
9                  US            M
10                 US            M
11                 US            M
...               ...          ...
3441               US            M
3502               US            L
3586               US            L
3665               DE            L
3709               DE            L

[1715 rows x 11 columns]>

In [21]:
duplicados = pd.DataFrame(df.value_counts())
duplicados[duplicados['count']>1]

                                                                                                                                                                   count
work_year experience_level employment_type job_title          salary  salary_currency salary_in_usd employee_residence remote_ratio company_location company_size
2022      SE               FT              Data Scientist     191475  USD             191475        US                 100          US               M                21
                                                              141525  USD             141525        US                 100          US               M                21
2023      SE               FT              Data Engineer      129000  USD             129000        US                 0            US               M                13
                                                              252000  USD             252000        US                 0            US               M                13
2022      SE               FT              Data Engineer      130000  USD             130000        US                 0            US               M                12
...                                                                                                                                                                  ...
          MI               FT              Data Engineer      65000   GBP             80036         GB                 100          GB               M                 2
2023      SE               FT              Research Scientist 253750  USD             253750        ES                 0            ES               M                 2
2022      MI               FT              Data Engineer      60000   GBP             73880         GB                 0            GB               M                 2
2020      EN               FT              Data Engineer      1000000 INR             13493         IN                 100          IN               L                 2
2022      MI               FT              Data Engineer      24000   USD             24000         US                 0            US               M                 2

[544 rows x 1 columns]

In [ ]:
def mas_repetidos(df): #incompleto 
    df_duplicados = df[df.duplicated(keep=False)]
    df_agrupado = df

In [22]:
df.drop_duplicates(inplace=True) #eliminar duplicados

In [23]:
df.shape

(2584, 11)

** EDA **

In [24]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

In [25]:
df.groupby('work_year')

In [ ]:
print('')